%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%最急降下%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%%%%%%%学習準備%%%%%%%%%%%%%%%%%%
X = 100*[1;1]; %変数初期値
Max = 10; %イタレーション上限
f_=zeros(Max,1); %間数値保存用
tau = 1e-4;%学習率更新刻み幅

%%%%%学習%%%%%%%%%%%%%%%%%%%%%%%

for i = 1:Max
 x = X(1); y = X(2); 
alp = 1;  %ステップサイズ初期化


f = fmake(X); %間数値
f_(i) = f;
grad_f = [2*x + y-1;
        x + 2*y]; %勾配
H_f = [2,1;
        1,2]; %ヘッセ行列

X = X-alp*inv(H_f)*grad_f; %更新

end


%%%%%%%%結果%%%%%%%%%%%%%%%%
figure(1)
plot([1:Max],f_,'LineWidth',1.5);hold on;
xlabel('ieration number');ylabel('cost');
hold off;