%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%最急降下%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%%%%%%%学習準備%%%%%%%%%%%%%%%%%%
X = 100*[1;1]; %変数初期値
Max = 100; %イタレーション上限
h_=zeros(Max,1); %間数値保存用
tau = 1e-4;%学習率更新刻み幅
grad_h = [1;1];

%%%%%学習%%%%%%%%%%%%%%%%%%%%%%%

for i = 1:Max
 x = X(1); y = X(2); 
alp = 1;  %ステップサイズ

h = hmake(X); %間数値
h_(i) = h;
grad_h = [2*x - 20*y^2;
        -40*x*y + 400*y^3]; %勾配

H_h = [2, -40*y;
    -40*y, -40*x + 120*y^2];

if rank(H_h) <2; error('ヘッセ行列が正則ではない'); end;

X = X- alp*inv(H_h)*grad_h;
end



%%%%%%%%結果%%%%%%%%%%%%%%%%
figure(1)
plot([1:Max],h_,'LineWidth',1.5);hold on;
xlabel('ieration number');ylabel('cost');
hold off;
