clear all;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%最急降下%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%%%%%%%学習準備%%%%%%%%%%%%%%%%%%
X = 100*[1;1;1]; %変数初期値
Max = 1000; %イタレーション上限
g_=zeros(Max,1); %間数値保存用
tau = 1e-2;%学習率更新刻み幅
grad_g = [1;1;1];
%%%%%学習%%%%%%%%%%%%%%%%%%%%%%%

for i = 1:Max;
 x = X(1); y = X(2); z = X(3);
alp = 0;  %ステップサイズ初期化
%alp = 1e-5; %固定ステップサイズ
zai = 0.5; % アルミホ定数
g = gmake(X);%間数値
g_(i) = g;

g1 =4*x^3 - 6*x^2*y + 4*x*z^3 - y*z;
g2 =  -2*x^3 - x*z + 4*y*z^2;
g3 = 6*x^2*z^2  -x*y +  4*y^2*z + 6*z^5;

grad_g = [g1;g2;g3];

h11 = 12*x^2-12*x*y + 4*z^3; h12 = -6*x^2-z;  h13 = 12*x*z^2 - y;
h21 = -6*x^2-z; h22 = 4*z^2; h23 = -x + 8*y*z;
h31 = 12*x*z^2-y; h32 = -x + 8*y*z; h33 = 12*x^2*z + 4*y^2 + 30*z^4;

H_g = [h11,h12,h13;
        h21,h22,h23;
        h31,h32,h33]; %ヘッセ行列
    
if rank(H_g) <3 ; error('ヘッセ行列が正則ではない'); end;
X = X- alp*inv(H_g)*grad_g;
end


%%%%%%%%結果%%%%%%%%%%%%%%%%
figure(1)
plot([1:i],g_,'LineWidth',1.5);hold on;
xlabel('ieration number');ylabel('cost');
hold off;
